In [211]:
#importing multiple libraries 

import pandas as pd
import numpy as np
import math as mt

# FILLING MISSING VALUES WITH NUMBERS BY ADDING 10

In [228]:
#READING DATA SET 
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})


flight = df["FlightNumber"]
new_flight=[]
i = 0


for fg in flight: 
    if mt.isnan(fg) == True:                            #USED ISNAN FUNCTION OF MATH LIBRARY 
        new_flight.append(flight[i-1] + 10)             # ADDED 10 IN PREVIOUS VALUE
    else:
        new_flight.append(fg)        
    i=i+1
print(new_flight)

    
df["FlightNumber"] = new_flight
df["FlightNumber"] = df["FlightNumber"].astype(int)    #CONVERTED TO INTEGER TYPE
df

[10045.0, 10055.0, 10065.0, 10075.0, 10085.0]

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

# SPLIT COLUMN  USING SPLIT FUNCTION

In [213]:
splitdata = df["From_To"].str.split("_") #SPLIT DATA USING DELEIMITER _

new_data = splitdata.tolist()
 
new_df = pd.DataFrame(new_data, columns=["From", "to"])

print(new_df)

       From         to
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# CAPITALIZE FIRST LETTER OF EACH WORD

In [229]:

new_df['From'] = new_df['From'].str.capitalize() # USING CAPITALIZE FUNTION 
new_df['to'] = new_df['to'].str.capitalize() 
new_df

       From         to
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# DROPPED From_to coloumn and added new columns

In [230]:
df=df.drop(columns="From_To",axis=1)
df['From']=new_df['From']
df['To']=new_df['to']
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

# split recentdelays to multiple columns

In [217]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist(), columns=['Delay_1','Delay_2','Delay_3'])
print (df3)

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

# dropped recentdelays and added multiple columns

In [231]:
df=df.drop(columns="RecentDelays",axis=1)
df['Delay_1']=df3['Delay_1']
df['Delay_2']=df3['Delay_2']
df['Delay_3']=df3['Delay_3']
df

,Airline,FlightNumber,From,To,Delay_1,Delay_2,Delay_3
0,KLM(!),10045,London,Paris,23.0,47.0,NaN
1,<Air France> (12),10055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
3,12. Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",10085,Brussels,London,67.0,32.0,NaN